; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-u-7)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	instrument6 - instrument
	instrument7 - instrument
	satellite4 - satellite
	instrument8 - instrument
	satellite5 - satellite
	instrument9 - instrument
	satellite6 - satellite
	instrument10 - instrument
	instrument11 - instrument
	satellite7 - satellite
	instrument12 - instrument
	satellite8 - satellite
	instrument13 - instrument
	satellite9 - satellite
	instrument14 - instrument
	instrument15 - instrument
	instrument16 - instrument
	image3 - mode
	image2 - mode
	image0 - mode
	image1 - mode
	GroundStation2 - direction
	GroundStation0 - direction
	GroundStation4 - direction
	Star1 - direction
	Star3 - direction
	Phenomenon5 - direction
	Star6 - direction
	Star7 - direction
	Planet8 - direction
	Planet9 - direction
	Planet10 - direction
	Planet11 - direction
	Planet12 - direction
	Phenomenon13 - direction
	Star14 - direction
	Phenomenon15 - direction
	Phenomenon16 - direction
	Phenomenon17 - direction
	Phenomenon18 - direction
	Planet19 - direction
	Star20 - direction
	Star21 - direction
	Planet22 - direction
	Phenomenon23 - direction
	Star24 - direction
	Planet25 - direction
	Phenomenon26 - direction
	Star27 - direction
	Planet28 - direction
	Star29 - direction
	Planet30 - direction
	Star31 - direction
	Planet32 - direction
	Planet33 - direction
	Planet34 - direction
	Planet35 - direction
	Planet36 - direction
	Planet37 - direction
	Phenomenon38 - direction
	Planet39 - direction
	Phenomenon40 - direction
	Phenomenon41 - direction
	Star42 - direction
	Star43 - direction
	Planet44 - direction
	Planet45 - direction
	Planet46 - direction
	Star47 - direction
	Planet48 - direction
	Planet49 - direction
	Star50 - direction
	Phenomenon51 - direction
	Phenomenon52 - direction
	Star53 - direction
	Phenomenon54 - direction
	Planet55 - direction
	Phenomenon56 - direction
	Phenomenon57 - direction
	Star58 - direction
	Phenomenon59 - direction
	Planet60 - direction
	Phenomenon61 - direction
	Star62 - direction
	Planet63 - direction
	Planet64 - direction
	Planet65 - direction
	Phenomenon66 - direction
	Phenomenon67 - direction
	Planet68 - direction
	Phenomenon69 - direction
	Planet70 - direction
	Star71 - direction
	Star72 - direction
	Phenomenon73 - direction
	Star74 - direction
)
(:init
	(supports instrument0 image0)
	(supports instrument0 image1)
	(calibration_target instrument0 GroundStation0)
	(supports instrument1 image1)
	(supports instrument1 image0)
	(calibration_target instrument1 GroundStation2)
	(supports instrument2 image3)
	(supports instrument2 image1)
	(supports instrument2 image0)
	(calibration_target instrument2 GroundStation0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon16)
	(supports instrument3 image1)
	(supports instrument3 image3)
	(supports instrument3 image0)
	(calibration_target instrument3 GroundStation4)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star50)
	(supports instrument4 image3)
	(calibration_target instrument4 Star1)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon52)
	(supports instrument5 image0)
	(supports instrument5 image3)
	(calibration_target instrument5 GroundStation2)
	(supports instrument6 image1)
	(calibration_target instrument6 GroundStation4)
	(supports instrument7 image0)
	(calibration_target instrument7 GroundStation2)
	(on_board instrument5 satellite3)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Phenomenon13)
	(supports instrument8 image0)
	(calibration_target instrument8 GroundStation2)
	(on_board instrument8 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star14)
	(supports instrument9 image0)
	(calibration_target instrument9 GroundStation0)
	(on_board instrument9 satellite5)
	(power_avail satellite5)
	(pointing satellite5 Planet30)
	(supports instrument10 image2)
	(calibration_target instrument10 Star1)
	(supports instrument11 image0)
	(calibration_target instrument11 Star3)
	(on_board instrument10 satellite6)
	(on_board instrument11 satellite6)
	(power_avail satellite6)
	(pointing satellite6 Star3)
	(supports instrument12 image3)
	(calibration_target instrument12 GroundStation4)
	(on_board instrument12 satellite7)
	(power_avail satellite7)
	(pointing satellite7 GroundStation4)
	(supports instrument13 image3)
	(supports instrument13 image1)
	(supports instrument13 image0)
	(calibration_target instrument13 Star1)
	(on_board instrument13 satellite8)
	(power_avail satellite8)
	(pointing satellite8 Planet37)
	(supports instrument14 image0)
	(calibration_target instrument14 Star1)
	(supports instrument15 image0)
	(supports instrument15 image1)
	(supports instrument15 image2)
	(calibration_target instrument15 Star1)
	(supports instrument16 image1)
	(calibration_target instrument16 Star3)
	(on_board instrument14 satellite9)
	(on_board instrument15 satellite9)
	(on_board instrument16 satellite9)
	(power_avail satellite9)
	(pointing satellite9 Planet9)
)
(:goal (and
	(pointing satellite2 Planet19)
	(have_image Phenomenon5 image0)
	(have_image Star6 image1)
	(have_image Star7 image0)
	(have_image Planet8 image0)
	(have_image Planet9 image3)
	(have_image Planet10 image0)
	(have_image Planet11 image2)
	(have_image Planet12 image1)
	(have_image Phenomenon13 image3)
	(have_image Star14 image3)
	(have_image Phenomenon15 image3)
	(have_image Phenomenon16 image3)
	(have_image Phenomenon17 image2)
	(have_image Phenomenon18 image0)
	(have_image Planet19 image0)
	(have_image Star20 image0)
	(have_image Star21 image0)
	(have_image Planet22 image3)
	(have_image Phenomenon23 image2)
	(have_image Star24 image3)
	(have_image Planet25 image1)
	(have_image Phenomenon26 image2)
	(have_image Star27 image3)
	(have_image Planet28 image3)
	(have_image Star29 image3)
	(have_image Planet30 image0)
	(have_image Planet32 image0)
	(have_image Planet34 image1)
	(have_image Planet35 image2)
	(have_image Planet36 image2)
	(have_image Planet37 image2)
	(have_image Phenomenon38 image0)
	(have_image Planet39 image0)
	(have_image Phenomenon40 image1)
	(have_image Phenomenon41 image1)
	(have_image Star42 image2)
	(have_image Star43 image2)
	(have_image Planet44 image3)
	(have_image Planet45 image2)
	(have_image Star47 image1)
	(have_image Planet48 image3)
	(have_image Planet49 image3)
	(have_image Star50 image1)
	(have_image Phenomenon51 image0)
	(have_image Phenomenon52 image1)
	(have_image Star53 image0)
	(have_image Phenomenon54 image0)
	(have_image Planet55 image1)
	(have_image Phenomenon57 image1)
	(have_image Phenomenon59 image1)
	(have_image Planet60 image1)
	(have_image Phenomenon61 image3)
	(have_image Star62 image3)
	(have_image Planet63 image2)
	(have_image Planet64 image0)
	(have_image Planet65 image3)
	(have_image Phenomenon66 image0)
	(have_image Phenomenon67 image1)
	(have_image Planet68 image0)
	(have_image Planet70 image0)
	(have_image Star71 image0)
	(have_image Star72 image1)
	(have_image Phenomenon73 image0)
	(have_image Star74 image0)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 65
2. (switch_on instrument10 satellite6)
   deleted: (power_avail satellite6)
   added: (power_on instrument10)
   goals met: 0 of 65
3. (switch_on instrument12 satellite7)
   deleted: (power_avail satellite7)
   added: (power_on instrument12)
   goals met: 0 of 65
4. (calibrate satellite7 instrument12 groundstation4)
   added: (calibrated instrument12)
   goals met: 0 of 65
5. (turn_to satellite0 groundstation0 phenomenon16)
   deleted: (pointing satellite0 phenomenon16)
   added: (pointing satellite0 groundstation0)
   goals met: 0 of 65
6. (calibrate satellite0 instrument0 groundstation0)
   added: (calibrated instrument0)
   goals met: 0 of 65
7. (turn_to satellite0 phenomenon18 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 phenomenon18)
   goals met: 0 of 65
8. (take_image satellite0 phenomenon18 instrument0 image0)
   added: (have_image phenomenon18 image0)
   goals met: 1 of 65
9. (turn_to satellite0 phenomenon38 phenomenon18)
   deleted: (pointing satellite0 phenomenon18)
   added: (pointing satellite0 phenomenon38)
   goals met: 1 of 65
10. (take_image satellite0 phenomenon38 instrument0 image0)
   added: (have_image phenomenon38 image0)
   goals met: 2 of 65
11. (turn_to satellite0 phenomenon40 phenomenon38)
   deleted: (pointing satellite0 phenomenon38)
   added: (pointing satellite0 phenomenon40)
   goals met: 2 of 65
12. (take_image satellite0 phenomenon40 instrument0 image1)
   added: (have_image phenomenon40 image1)
   goals met: 3 of 65
13. (turn_to satellite0 phenomenon41 phenomenon40)
   deleted: (pointing satellite0 phenomenon40)
   added: (pointing satellite0 phenomenon41)
   goals met: 3 of 65
14. (take_image satellite0 phenomenon41 instrument0 image1)
   added: (have_image phenomenon41 image1)
   goals met: 4 of 65
15. (turn_to satellite0 phenomenon5 phenomenon41)
   deleted: (pointing satellite0 phenomenon41)
   added: (pointing satellite0 phenomenon5)
   goals met: 4 of 65
16. (take_image satellite0 phenomenon5 instrument0 image0)
   added: (have_image phenomenon5 image0)
   goals met: 5 of 65
17. (turn_to satellite0 phenomenon51 phenomenon5)
   deleted: (pointing satellite0 phenomenon5)
   added: (pointing satellite0 phenomenon51)
   goals met: 5 of 65
18. (take_image satellite0 phenomenon51 instrument0 image0)
   added: (have_image phenomenon51 image0)
   goals met: 6 of 65
19. (turn_to satellite0 phenomenon52 phenomenon51)
   deleted: (pointing satellite0 phenomenon51)
   added: (pointing satellite0 phenomenon52)
   goals met: 6 of 65
20. (take_image satellite0 phenomenon52 instrument0 image1)
   added: (have_image phenomenon52 image1)
   goals met: 7 of 65
21. (turn_to satellite0 phenomenon54 phenomenon52)
   deleted: (pointing satellite0 phenomenon52)
   added: (pointing satellite0 phenomenon54)
   goals met: 7 of 65
22. (take_image satellite0 phenomenon54 instrument0 image0)
   added: (have_image phenomenon54 image0)
   goals met: 8 of 65
23. (turn_to satellite0 phenomenon57 phenomenon54)
   deleted: (pointing satellite0 phenomenon54)
   added: (pointing satellite0 phenomenon57)
   goals met: 8 of 65
24. (take_image satellite0 phenomenon57 instrument0 image1)
   added: (have_image phenomenon57 image1)
   goals met: 9 of 65
25. (turn_to satellite0 phenomenon59 phenomenon57)
   deleted: (pointing satellite0 phenomenon57)
   added: (pointing satellite0 phenomenon59)
   goals met: 9 of 65
26. (take_image satellite0 phenomenon59 instrument0 image1)
   added: (have_image phenomenon59 image1)
   goals met: 10 of 65
27. (turn_to satellite0 phenomenon66 phenomenon59)
   deleted: (pointing satellite0 phenomenon59)
   added: (pointing satellite0 phenomenon66)
   goals met: 10 of 65
28. (take_image satellite0 phenomenon66 instrument0 image0)
   added: (have_image phenomenon66 image0)
   goals met: 11 of 65
29. (turn_to satellite0 phenomenon67 phenomenon66)
   deleted: (pointing satellite0 phenomenon66)
   added: (pointing satellite0 phenomenon67)
   goals met: 11 of 65
30. (take_image satellite0 phenomenon67 instrument0 image1)
   added: (have_image phenomenon67 image1)
   goals met: 12 of 65
31. (turn_to satellite0 phenomenon73 phenomenon67)
   deleted: (pointing satellite0 phenomenon67)
   added: (pointing satellite0 phenomenon73)
   goals met: 12 of 65
32. (take_image satellite0 phenomenon73 instrument0 image0)
   added: (have_image phenomenon73 image0)
   goals met: 13 of 65
33. (turn_to satellite0 planet10 phenomenon73)
   deleted: (pointing satellite0 phenomenon73)
   added: (pointing satellite0 planet10)
   goals met: 13 of 65
34. (take_image satellite0 planet10 instrument0 image0)
   added: (have_image planet10 image0)
   goals met: 14 of 65
35. (turn_to satellite0 planet12 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 planet12)
   goals met: 14 of 65
36. (take_image satellite0 planet12 instrument0 image1)
   added: (have_image planet12 image1)
   goals met: 15 of 65
37. (turn_to satellite0 planet19 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 planet19)
   goals met: 15 of 65
38. (take_image satellite0 planet19 instrument0 image0)
   added: (have_image planet19 image0)
   goals met: 16 of 65
39. (turn_to satellite0 planet25 planet19)
   deleted: (pointing satellite0 planet19)
   added: (pointing satellite0 planet25)
   goals met: 16 of 65
40. (take_image satellite0 planet25 instrument0 image1)
   added: (have_image planet25 image1)
   goals met: 17 of 65
41. (turn_to satellite0 planet30 planet25)
   deleted: (pointing satellite0 planet25)
   added: (pointing satellite0 planet30)
   goals met: 17 of 65
42. (take_image satellite0 planet30 instrument0 image0)
   added: (have_image planet30 image0)
   goals met: 18 of 65
43. (turn_to satellite0 planet32 planet30)
   deleted: (pointing satellite0 planet30)
   added: (pointing satellite0 planet32)
   goals met: 18 of 65
44. (take_image satellite0 planet32 instrument0 image0)
   added: (have_image planet32 image0)
   goals met: 19 of 65
45. (turn_to satellite0 planet34 planet32)
   deleted: (pointing satellite0 planet32)
   added: (pointing satellite0 planet34)
   goals met: 19 of 65
46. (take_image satellite0 planet34 instrument0 image1)
   added: (have_image planet34 image1)
   goals met: 20 of 65
47. (turn_to satellite0 planet39 planet34)
   deleted: (pointing satellite0 planet34)
   added: (pointing satellite0 planet39)
   goals met: 20 of 65
48. (take_image satellite0 planet39 instrument0 image0)
   added: (have_image planet39 image0)
   goals met: 21 of 65
49. (turn_to satellite0 planet55 planet39)
   deleted: (pointing satellite0 planet39)
   added: (pointing satellite0 planet55)
   goals met: 21 of 65
50. (take_image satellite0 planet55 instrument0 image1)
   added: (have_image planet55 image1)
   goals met: 22 of 65
51. (turn_to satellite0 planet60 planet55)
   deleted: (pointing satellite0 planet55)
   added: (pointing satellite0 planet60)
   goals met: 22 of 65
52. (take_image satellite0 planet60 instrument0 image1)
   added: (have_image planet60 image1)
   goals met: 23 of 65
53. (turn_to satellite0 planet64 planet60)
   deleted: (pointing satellite0 planet60)
   added: (pointing satellite0 planet64)
   goals met: 23 of 65
54. (take_image satellite0 planet64 instrument0 image0)
   added: (have_image planet64 image0)
   goals met: 24 of 65
55. (turn_to satellite0 planet68 planet64)
   deleted: (pointing satellite0 planet64)
   added: (pointing satellite0 planet68)
   goals met: 24 of 65
56. (take_image satellite0 planet68 instrument0 image0)
   added: (have_image planet68 image0)
   goals met: 25 of 65
57. (turn_to satellite0 planet70 planet68)
   deleted: (pointing satellite0 planet68)
   added: (pointing satellite0 planet70)
   goals met: 25 of 65
58. (take_image satellite0 planet70 instrument0 image0)
   added: (have_image planet70 image0)
   goals met: 26 of 65
59. (turn_to satellite0 planet8 planet70)
   deleted: (pointing satellite0 planet70)
   added: (pointing satellite0 planet8)
   goals met: 26 of 65
60. (take_image satellite0 planet8 instrument0 image0)
   added: (have_image planet8 image0)
   goals met: 27 of 65
61. (turn_to satellite0 star20 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 star20)
   goals met: 27 of 65
62. (take_image satellite0 star20 instrument0 image0)
   added: (have_image star20 image0)
   goals met: 28 of 65
63. (turn_to satellite0 star21 star20)
   deleted: (pointing satellite0 star20)
   added: (pointing satellite0 star21)
   goals met: 28 of 65
64. (take_image satellite0 star21 instrument0 image0)
   added: (have_image star21 image0)
   goals met: 29 of 65
65. (turn_to satellite0 star47 star21)
   deleted: (pointing satellite0 star21)
   added: (pointing satellite0 star47)
   goals met: 29 of 65
66. (take_image satellite0 star47 instrument0 image1)
   added: (have_image star47 image1)
   goals met: 30 of 65
67. (turn_to satellite0 star50 star47)
   deleted: (pointing satellite0 star47)
   added: (pointing satellite0 star50)
   goals met: 30 of 65
68. (take_image satellite0 star50 instrument0 image1)
   added: (have_image star50 image1)
   goals met: 31 of 65
69. (turn_to satellite0 star53 star50)
   deleted: (pointing satellite0 star50)
   added: (pointing satellite0 star53)
   goals met: 31 of 65
70. (take_image satellite0 star53 instrument0 image0)
   added: (have_image star53 image0)
   goals met: 32 of 65
71. (turn_to satellite0 star6 star53)
   deleted: (pointing satellite0 star53)
   added: (pointing satellite0 star6)
   goals met: 32 of 65
72. (take_image satellite0 star6 instrument0 image1)
   added: (have_image star6 image1)
   goals met: 33 of 65
73. (turn_to satellite0 star7 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 star7)
   goals met: 33 of 65
74. (take_image satellite0 star7 instrument0 image0)
   added: (have_image star7 image0)
   goals met: 34 of 65
75. (turn_to satellite0 star71 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 star71)
   goals met: 34 of 65
76. (take_image satellite0 star71 instrument0 image0)
   added: (have_image star71 image0)
   goals met: 35 of 65
77. (turn_to satellite0 star72 star71)
   deleted: (pointing satellite0 star71)
   added: (pointing satellite0 star72)
   goals met: 35 of 65
78. (take_image satellite0 star72 instrument0 image1)
   added: (have_image star72 image1)
   goals met: 36 of 65
79. (turn_to satellite0 star74 star72)
   deleted: (pointing satellite0 star72)
   added: (pointing satellite0 star74)
   goals met: 36 of 65
80. (take_image satellite0 star74 instrument0 image0)
   added: (have_image star74 image0)
   goals met: 37 of 65
81. (turn_to satellite6 star1 star3)
   deleted: (pointing satellite6 star3)
   added: (pointing satellite6 star1)
   goals met: 37 of 65
82. (calibrate satellite6 instrument10 star1)
   added: (calibrated instrument10)
   goals met: 37 of 65
83. (turn_to satellite6 phenomenon17 star1)
   deleted: (pointing satellite6 star1)
   added: (pointing satellite6 phenomenon17)
   goals met: 37 of 65
84. (take_image satellite6 phenomenon17 instrument10 image2)
   added: (have_image phenomenon17 image2)
   goals met: 38 of 65
85. (turn_to satellite6 phenomenon23 phenomenon17)
   deleted: (pointing satellite6 phenomenon17)
   added: (pointing satellite6 phenomenon23)
   goals met: 38 of 65
86. (take_image satellite6 phenomenon23 instrument10 image2)
   added: (have_image phenomenon23 image2)
   goals met: 39 of 65
87. (turn_to satellite6 phenomenon26 phenomenon23)
   deleted: (pointing satellite6 phenomenon23)
   added: (pointing satellite6 phenomenon26)
   goals met: 39 of 65
88. (take_image satellite6 phenomenon26 instrument10 image2)
   added: (have_image phenomenon26 image2)
   goals met: 40 of 65
89. (turn_to satellite6 planet11 phenomenon26)
   deleted: (pointing satellite6 phenomenon26)
   added: (pointing satellite6 planet11)
   goals met: 40 of 65
90. (take_image satellite6 planet11 instrument10 image2)
   added: (have_image planet11 image2)
   goals met: 41 of 65
91. (turn_to satellite6 planet35 planet11)
   deleted: (pointing satellite6 planet11)
   added: (pointing satellite6 planet35)
   goals met: 41 of 65
92. (take_image satellite6 planet35 instrument10 image2)
   added: (have_image planet35 image2)
   goals met: 42 of 65
93. (turn_to satellite6 planet36 planet35)
   deleted: (pointing satellite6 planet35)
   added: (pointing satellite6 planet36)
   goals met: 42 of 65
94. (take_image satellite6 planet36 instrument10 image2)
   added: (have_image planet36 image2)
   goals met: 43 of 65
95. (turn_to satellite6 planet37 planet36)
   deleted: (pointing satellite6 planet36)
   added: (pointing satellite6 planet37)
   goals met: 43 of 65
96. (take_image satellite6 planet37 instrument10 image2)
   added: (have_image planet37 image2)
   goals met: 44 of 65
97. (turn_to satellite6 planet45 planet37)
   deleted: (pointing satellite6 planet37)
   added: (pointing satellite6 planet45)
   goals met: 44 of 65
98. (take_image satellite6 planet45 instrument10 image2)
   added: (have_image planet45 image2)
   goals met: 45 of 65
99. (turn_to satellite6 planet63 planet45)
   deleted: (pointing satellite6 planet45)
   added: (pointing satellite6 planet63)
   goals met: 45 of 65
100. (take_image satellite6 planet63 instrument10 image2)
   added: (have_image planet63 image2)
   goals met: 46 of 65
101. (turn_to satellite6 star42 planet63)
   deleted: (pointing satellite6 planet63)
   added: (pointing satellite6 star42)
   goals met: 46 of 65
102. (take_image satellite6 star42 instrument10 image2)
   added: (have_image star42 image2)
   goals met: 47 of 65
103. (turn_to satellite6 star43 star42)
   deleted: (pointing satellite6 star42)
   added: (pointing satellite6 star43)
   goals met: 47 of 65
104. (take_image satellite6 star43 instrument10 image2)
   added: (have_image star43 image2)
   goals met: 48 of 65
105. (turn_to satellite7 phenomenon13 groundstation4)
   deleted: (pointing satellite7 groundstation4)
   added: (pointing satellite7 phenomenon13)
   goals met: 48 of 65
106. (take_image satellite7 phenomenon13 instrument12 image3)
   added: (have_image phenomenon13 image3)
   goals met: 49 of 65
107. (turn_to satellite7 phenomenon15 phenomenon13)
   deleted: (pointing satellite7 phenomenon13)
   added: (pointing satellite7 phenomenon15)
   goals met: 49 of 65
108. (take_image satellite7 phenomenon15 instrument12 image3)
   added: (have_image phenomenon15 image3)
   goals met: 50 of 65
109. (turn_to satellite7 phenomenon16 phenomenon15)
   deleted: (pointing satellite7 phenomenon15)
   added: (pointing satellite7 phenomenon16)
   goals met: 50 of 65
110. (take_image satellite7 phenomenon16 instrument12 image3)
   added: (have_image phenomenon16 image3)
   goals met: 51 of 65
111. (turn_to satellite7 phenomenon61 phenomenon16)
   deleted: (pointing satellite7 phenomenon16)
   added: (pointing satellite7 phenomenon61)
   goals met: 51 of 65
112. (take_image satellite7 phenomenon61 instrument12 image3)
   added: (have_image phenomenon61 image3)
   goals met: 52 of 65
113. (turn_to satellite7 planet22 phenomenon61)
   deleted: (pointing satellite7 phenomenon61)
   added: (pointing satellite7 planet22)
   goals met: 52 of 65
114. (take_image satellite7 planet22 instrument12 image3)
   added: (have_image planet22 image3)
   goals met: 53 of 65
115. (turn_to satellite7 planet28 planet22)
   deleted: (pointing satellite7 planet22)
   added: (pointing satellite7 planet28)
   goals met: 53 of 65
116. (take_image satellite7 planet28 instrument12 image3)
   added: (have_image planet28 image3)
   goals met: 54 of 65
117. (turn_to satellite7 planet44 planet28)
   deleted: (pointing satellite7 planet28)
   added: (pointing satellite7 planet44)
   goals met: 54 of 65
118. (take_image satellite7 planet44 instrument12 image3)
   added: (have_image planet44 image3)
   goals met: 55 of 65
119. (turn_to satellite7 planet48 planet44)
   deleted: (pointing satellite7 planet44)
   added: (pointing satellite7 planet48)
   goals met: 55 of 65
120. (take_image satellite7 planet48 instrument12 image3)
   added: (have_image planet48 image3)
   goals met: 56 of 65
121. (turn_to satellite7 planet49 planet48)
   deleted: (pointing satellite7 planet48)
   added: (pointing satellite7 planet49)
   goals met: 56 of 65
122. (take_image satellite7 planet49 instrument12 image3)
   added: (have_image planet49 image3)
   goals met: 57 of 65
123. (turn_to satellite7 planet65 planet49)
   deleted: (pointing satellite7 planet49)
   added: (pointing satellite7 planet65)
   goals met: 57 of 65
124. (take_image satellite7 planet65 instrument12 image3)
   added: (have_image planet65 image3)
   goals met: 58 of 65
125. (turn_to satellite7 planet9 planet65)
   deleted: (pointing satellite7 planet65)
   added: (pointing satellite7 planet9)
   goals met: 58 of 65
126. (take_image satellite7 planet9 instrument12 image3)
   added: (have_image planet9 image3)
   goals met: 59 of 65
127. (turn_to satellite7 star14 planet9)
   deleted: (pointing satellite7 planet9)
   added: (pointing satellite7 star14)
   goals met: 59 of 65
128. (take_image satellite7 star14 instrument12 image3)
   added: (have_image star14 image3)
   goals met: 60 of 65
129. (turn_to satellite7 star24 star14)
   deleted: (pointing satellite7 star14)
   added: (pointing satellite7 star24)
   goals met: 60 of 65
130. (take_image satellite7 star24 instrument12 image3)
   added: (have_image star24 image3)
   goals met: 61 of 65
131. (turn_to satellite7 star27 star24)
   deleted: (pointing satellite7 star24)
   added: (pointing satellite7 star27)
   goals met: 61 of 65
132. (take_image satellite7 star27 instrument12 image3)
   added: (have_image star27 image3)
   goals met: 62 of 65
133. (turn_to satellite7 star29 star27)
   deleted: (pointing satellite7 star27)
   added: (pointing satellite7 star29)
   goals met: 62 of 65
134. (take_image satellite7 star29 instrument12 image3)
   added: (have_image star29 image3)
   goals met: 63 of 65
135. (turn_to satellite7 star62 star29)
   deleted: (pointing satellite7 star29)
   added: (pointing satellite7 star62)
   goals met: 63 of 65
136. (take_image satellite7 star62 instrument12 image3)
   added: (have_image star62 image3)
   goals met: 64 of 65
137. (turn_to satellite2 planet19 phenomenon52)
   deleted: (pointing satellite2 phenomenon52)
   added: (pointing satellite2 planet19)
   goals met: 65 of 65
